
nc: 80  # number of classes
scales:   # [depth, width, max_channels]
  T: [0.33, 0.25, 1024]  #Mamba-YOLOv8-T summary: 6.1M parameters,   14.3GFLOPs


# Mamba-YOLO backbone 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128, 3]]   # 0-P2/4
  - [-1, 3, VSSBlock, [128]]               # 1
  - [-1, 1, VisionClueMerge, [256]]      # 2 p3/8
  - [-1, 3, VSSBlock, [256]]              # 3
  - [-1, 1, VisionClueMerge, [512]]      # 4 p4/16
  - [-1, 9, VSSBlock, [512]]              # 5
  - [-1, 1, VisionClueMerge, [1024]]      # 6 p5/32
  - [-1, 3, VSSBlock, [1024]]              # 7
  - [-1, 1, SPPF, [1024, 5]]               # 8
  - [-1, 1, PSA, [1024]] # 9

# Mamba-YOLO PAFPN
head:
  # - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  # - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  # - [-1, 3, XSSBlock, [512]]  # 11

  # - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  # - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  # - [-1, 3, XSSBlock, [256]]  # 14 (P3/8-small)

  # - [-1, 1, Conv, [256, 3, 2]]
  # - [[-1, 11], 1, Concat, [1]]  # cat head P4
  # - [-1, 3, XSSBlock, [512]]  # 17 (P4/16-medium)

  # - [-1, 1, Conv, [512, 3, 2]]
  # - [[-1, 8], 1, Concat, [1]]  # cat head P5
  # - [-1, 3, XSSBlock, [1024]]  # 20 (P5/32-large)

  # - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)

  - [5, 1, AVG, []] # 10
  - [[-1, 9], 1, Concat, [1]] # 11
  - [-1, 1, XSSBlock, [512]] # 12
  # - [-1, 1, RepHMS, [512, 2, 1, 3, 9]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [9, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [3, 1, AVG, []] # 15
  - [[-1, 5, -2, -3], 1, Concat, [1]] # 16
  - [-1, 1, XSSBlock, [384]] # 17
  # - [-1, 1, RepHMS, [384, 2, 1, 3, 7]] # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [5, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [1, 1, AVG, []] # 20
  - [[-1, 3, -2, -3], 1, Concat, [1]] # 21
  - [-1, 1, XSSBlock, [384]] # 22
  # - [-1, 1, RepHMS, [384, 2, 1, 3, 5]] # 22

  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 23
  - [[-1, -2], 1, Concat, [1]] # 24
  - [-1, 1, XSSBlock, [384]] # 25
  # - [-1, 1, RepHMS, [384, 2, 1, 3, 5]] # 25

  - [-1, 1, Conv, [384, 3, 2]] # 26
  - [22, 1, AVG, []] # 27
  - [12, 1, nn.Upsample, [None, 2, "nearest"]] # 28
  - [[-2, -1, 17, -3], 1, Concat, [1]] # 29
  - [-1, 1, XSSBlock, [384]] # 30
  # - [-1, 1, RepHMS, [384, 2, 1, 3, 7]] # 30

  - [-1, 1, Conv, [384, 3, 2]] # 31
  - [17, 1, AVG, []] # 32
  - [[-2, -1, 12], 1, Concat, [1]] # 33
  - [-1, 1, XSSBlock, [512]] # 34
  # - [-1, 1, RepHMS, [512, 2, 1, 3, 9]] # 34

  - [[25, 30, 34], 1, Detect, [nc]] # v8Detect
  # - [[25, 30, 34], 1, v10Detect, [nc]] # v10Detect


